src/app/models/textbook.rb

SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."name" = ? LIMIT ?  [["name", "ddd"], ["LIMIT", 1]]
---
  def self.search(search)
    if search
      textbook = Textbook.find_by(name: search)

SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "User 1"], ["LIMIT", 1]]
UPDATE "textbooks" SET "user" = ?, "updated_at" = ? WHERE "textbooks"."id" = ?  [["user", "Success"], ["updated_at", "2019-11-25 06:26:09.492380"], ["id", 3]]
UPDATE "users" SET "message" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def make_offer(offer, id)
     if offer
      textbook = Textbook.find_by(id: id)
      user = textbook.user
      user = User.find_by(name: user)
      if user.message
        mes = user.message << "\n" << current_user.name << " made an offer of " << offer << " on " << textbook.name
      else
        mes = current_user.name << "made an offer of " << offer.to_s << " on " << title
      end
      user.update_attribute(:message, mes)