src/app/controllers/textbooks_controller.rb

  def index
    @textbooks = Textbook.all
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."textbook_id" = ? ORDER BY "textbooks"."id" ASC LIMIT ?  [["textbook_id", 3], ["LIMIT", 1]]

  def create
    t = textbook_params
    t[:user] = current_user
    @textbook = Textbook.new(t)
    respond_to do |format|
      if @textbook.save
---
INSERT INTO "textbooks" ("name", "condition", "edition", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Math Book"], ["condition", "Fair"], ["edition", "2nd"], ["created_at", "2019-11-24 23:39:06.655116"], ["updated_at", "2019-11-24 23:39:06.655116"], ["user", "User 1"]]

  def update
    respond_to do |format|
      if @textbook.update(textbook_params)
---
UPDATE "textbooks" SET "price" = ?, "updated_at" = ? WHERE "textbooks"."id" = ?  [["price", 21.5], ["updated_at", "2019-11-25 03:13:22.513690"], ["id", 3]]

  def destroy
    @textbook.destroy
---
DELETE FROM "textbooks" WHERE "textbooks"."id" = ?  [["id", 1]]

    def set_textbook
      @textbook = Textbook.find(params[:id])
---
SELECT  "textbooks".* FROM "textbooks" WHERE "textbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]