src/app/controllers/users_controller.rb

  def profile
    @textbooks = Textbook.all
---
SELECT "textbooks".* FROM "textbooks"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Admin"], ["created_at", "2019-11-24 21:52:29.179768"], ["updated_at", "2019-11-24 21:52:29.179768"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "message" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["message", "1"], ["updated_at", "2019-11-25 08:49:17.368201"], ["id", 6]]